#include <stdio.h>

//位运算符有6种：按位取反 ~ ,按位与 & ，按位或 | ，按位异或 ^ ，左移位 << ，右移位 >> C语言中没有无符号右移位
//其中只有按位取反 ~ 是单目运算符 其他均为双目运算符
//注意事项:操作对象不能是double,float,long double等其他数据类型，只能是char和int类型

int main()
{
	////(1)按位取反 ~ 常用于文件加密，第一次取反是加密，第二次取反是解密
	////按位取反就是对操作数的的各位进行取反，即1变为0，0变为1；

	//int num1 = 5;
	//int num2 = 6;
	//int num3 = -5;
	//int num4 = -6;

	////00000000 00000000 00000000 00000101 - 5的补码
	////11111111 11111111 11111111 11111010（取反）- -6的补码
	////10000000 00000000 00000000 00000110 - -6的原码
	//
	////00000000 00000000 00000000 00000110 - 6的补码
	////11111111 11111111 11111111 11111001(取反) - -7的补码
	////10000000 00000000 00000000 00000110 - -7的原码
	//
	////10000000 00000000 00000000 00000101 - -5的原码
	////11111111 11111111 11111111 11111010 - -5的反码
	////11111111 11111111 11111111 11111011 - -5的补码
	////00000000 00000000 00000000 00000100(取反) - 4的补码
	//
	////10000000 00000000 00000000 00000110 - -6的原码
	////11111111 11111111 11111111 11111001 - -6的反码
	////11111111 11111111 11111111 11111010 - -6的补码
	////00000000 00000000 00000000 00000101(取反) - 5的补码 
	//
	//int resurt1 = ~num1;
	//int resurt2 = ~num2;
	//int resurt3 = ~num3;
	//int resurt4 = ~num4;
	// 
	//printf("%d\n", resurt1); //5 -> -6
	//printf("%d\n", resurt2); //6 -> -7
	//printf("%d\n", resurt3); //-5 -> 4
	//printf("%d\n", resurt4); //-6 -> 5


	//(2)按位与，按位或，按位异或
	int num1 = 3;
	int num2 = -5;
	int num3 = 7;
	int num4 = -9;

	//int ret1 = num1 & num2;
	//int ret2 = num1 & num3;
	//int ret3 = num2 & num3;
	//int ret4 = num2 & num4;

	//int ret1 = num1 | num2;
	//int ret2 = num1 | num3;
	//int ret3 = num2 | num3;
	//int ret4 = num2 | num4;

	int ret1 = num1 ^ num2;
	int ret2 = num1 ^ num3;
	int ret3 = num2 ^ num3;
	int ret4 = num2 ^ num4;

	//00000000 00000000 00000000 00000011 - 3的补码
	//11111111 11111111 11111111 11111011 - -5的补码
	//00000000 00000000 00000000 00000111 - 7的补码
	//11111111 11111111 11111111 11110111 - -9的补码
 	//00000000 00000000 00000000 00000011 - 3 & -5
	//00000000 00000000 00000000 00000011 - 3 & 7
	//00000000 00000000 00000000 00000011 - -5 & 7
	//11111111 11111111 11111111 11110011 - -5 & -9
	//10000000 00000000 00000000 00001100
	//10000000 00000000 00000000 00001101 - -13的原码 

	//printf("%d\n", ret1);//3 & -5 -> 3
	//printf("%d\n", ret2);//3 & 7 -> 3
	//printf("%d\n", ret3);//-5 -> 7 -> 3 
	//printf("%d\n", ret4);//-5 & -9 -> -13

	//printf("%d\n", ret1); //-5
	//printf("%d\n", ret2); //7
	//printf("%d\n", ret3); //-1
	//printf("%d\n", ret4); //-1

	printf("%d\n", ret1); //-8
	printf("%d\n", ret2); //4
	printf("%d\n", ret3); //-4
	printf("%d\n", ret4); //12

	//3 ^ 3 = 0 0 ^ 5 = 5;相同之间的数异或为0；与0异或的数为他本身 异或支持交换律

	return 0;
}